Revit 2026 API

# ViewIsWorksetVisible Method

---

Indicates whether the workset is visible in this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsWorksetVisible(
	WorksetId worksetId
)
```
```vb
Public Function IsWorksetVisible (
	worksetId As WorksetId
) As Boolean
```
```cpp
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
```
```fsharp
member IsWorksetVisible :
        worksetId : WorksetId -> bool
```

#### Parameters

worksetId WorksetId
     Id of the workset.

#### Return Value

Boolean Whether the workset is visible.

| Exception | Condition |
| --- | --- |
| ArgumentException | There is no workset with this Id in the document associated with this view. |
| ArgumentNullException | A non-optional argument was null |

It will take into account whether the workset is opened or closed.

#### Reference

View Class

Autodesk.Revit.DB Namespace